#+TITLE: Modern C++

* Rvalue Reference
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream>
void printInt(int& i) { std::cout << "lvalue reference: " << i << std::endl; }
void printInt(int&& i) { std::cout << "rvalue reference: " << i << std::endl; }

int main() {
  int i = 6;
  printInt(i); // lvalue reference
  printInt(6); // rvalue reference
}
#+END_SRC

#+RESULTS:
| lvalue | reference: | 6 |
| rvalue | reference: | 6 |

** Moving Semantics
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream>
class boVector {
  int size;
  double* arr;
public:
  explicit boVector(int s) {
    size = s;
    arr = new double[size];
    for (int i = 0; i < s; i++)
      arr[i] = i;
  }

  boVector(const boVector& rhs) { // Copy constructor
    size = rhs.size;
    arr = new double[size];
    for (int i = 0; i < size; i++)
      arr[i] = rhs.arr[i];
  }

  boVector(boVector&& rhs) { // Move constructor
    size = rhs.size;
    arr = rhs.arr;
    rhs.arr = nullptr;
  }

  void print() {
    for (int i = 0; i < size; i++)
      std::cout << arr[i] << std::endl;
  }

  ~boVector() { delete arr; }
};

void foo(boVector v) {
  v.print();
}

void foo_by_ref(boVector& v) {
  v.print();
}

boVector createBoVector() {
  boVector v(10);
  return v;
}

int main() {
  boVector reusable = createBoVector();
  foo(reusable); // call copy constructor to make a copy of reusable,
                 // then pass to foo => costly
  foo(std::move(reusable)); // call move constructor, efficient as foo_by_ref
                            // after calling, reusable.arr = nullptr
  foo(createBoVector()); // call move constructor (shallow copy)
}
#+END_SRC

#+RESULTS:
| 0 |
| 1 |
| 2 |
| 3 |
| 4 |
| 5 |
| 6 |
| 7 |
| 8 |
| 9 |
| 0 |
| 1 |
| 2 |
| 3 |
| 4 |
| 5 |
| 6 |
| 7 |
| 8 |
| 9 |
| 0 |
| 1 |
| 2 |
| 3 |
| 4 |
| 5 |
| 6 |
| 7 |
| 8 |
| 9 |

Note:
1. The most useful place for rvalue reference is overloading copy constructor
and copy assignment operator to achieve move semantics.
#+BEGIN_SRC C++
class X {
  X(const X& rhs);
  X(X&& rhs);

  X& X::operator=(const X& rhs);
  X& X::operator=(X&& rhs);
};
#+END_SRC

2. Move semantics is implemented for all STL containers

** C++03
#+BEGIN_SRC C++ :includes <iostream>
enum apple {green_a, red_a};
enum orange {big_o, small_o};
apple a = green_a;
orange o = big_o;

if (a == o) 
  std::cout << "green apple and big orange are the same\n";
else
  std::cout << "green apple and big orange are not the same\n";
#+END_SRC

#+RESULTS:
: green apple and big orange are the same

* lambda function
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream> <vector>
using namespace std;

template<typename func>
void filter(func f, vector<int> arr) {
   for (auto i: arr) {
      if (f(i))
         cout << i << " ";
   }
}

int main() {
   vector<int> v = {1, 2, 3, 4, 5, 6 };

   filter([](int x) {return (x>3);},  v);    // Output: 4 5 6
   filter([](int x) {return (x>2 && x<5);},  v); // Output: 3 4

   int y = 4;  
   filter([&](int x) {return (x>y);},  v);    // Output: 5 6
   //Note: [&] tells compiler that we want variable capture
}
#+END_SRC

#+RESULTS:
: 4 5 6 3 4 5 6

** C++ 11
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream>
  long double operator"" _cm(long double x) { return x * 10; }
  long double operator"" _m(long double x) { return x * 1000; }
  long double operator"" _mm(long double x) { return x; }

  int operator"" _bin(const char* str, size_t l) {
    int ret = 0;
    for (int i = 0; i < l; i++) {
      ret = ret << 1;
      if (str[i] == '1')
        ret += 1;
    }
    return ret;
  }

  int main() {
    long double height = 3.4_cm;
    std::cout << height  << std::endl;              // 34
    std::cout << (height + 13.0_m)  << std::endl;   // 13034
    std::cout << (130.0_mm / 13.0_m)  << std::endl; // 0.01

    std::cout << "110"_bin << std:: endl; // 6
  }
#+END_SRC

#+RESULTS:
|    34 |
| 13034 |
|  0.01 |
|     6 |

Note: add constexpr to make the translation happen in compile time.

Restriction: it can only work with following paramters:
   char const*
   unsigned long long
   long double
   char const*, std::size_t
   wchar_t const*, std::size_t
   char16_t const*, std::size_t
   char32_t const*, std::size_t
Note: return value can be of any types.

#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream>
int operator"" _hex(char const* str, size_t l) { 
  // Convert hexdecimal formated str to integer ret
  int ret = 0;
  return ret;
}

int operator"" _oct(char const* str, size_t l) { 
  // Convert octal formated str to integer ret
  int ret = 0;
  return ret;
}

int main() {
  std::cout << "FF"_hex << std::endl;  // 255
  std::cout << "40"_oct << std::endl;  // 32
}
#+END_SRC

#+RESULTS:
| 0 |
| 0 |

** Shared Pointer
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream> <string> <memory>
class Dog {
  std::string name;
public:
  Dog(std::string name) {
    std::cout << "Constructor: " << name << std::endl;
    this->name = name;
  }
  Dog() {
    std::cout << "Constructor: No Name" << std::endl;
    this->name = "No Name";
  }
  ~Dog() { std::cout << "Destructor: " << name << std::endl; }
};

void basic() {
  std::shared_ptr<Dog> p(new Dog("Gunner"));
  std::cout << "Number of pointers point to p: " << p.use_count() << std::endl;
  {
    std::shared_ptr<Dog> p1 = p;
    std::cout << "Number of pointers point to p: " << p.use_count() << std::endl;
  }
  std::cout << "Number of pointers point to p: " << p.use_count() << std::endl;

  std::shared_ptr<Dog> p1 = std::make_shared<Dog>("Tank"); // faster and safer
}

void custom_deleter() {
  //std::shared_ptr<Dog> p1(new Dog[3]); // dog[1] and dog[2] have memory leaks
  std::shared_ptr<Dog> p2(new Dog[3], [](Dog* p) { delete[] p; }); // all 3 dogs will be deleted
}

int main() {
  basic();
  custom_deleter();
}
#+END_SRC

#+RESULTS:
| Constructor: | Gunner |          |       |    |    |   |
| Number       | of     | pointers | point | to | p: | 1 |
| Number       | of     | pointers | point | to | p: | 2 |
| Number       | of     | pointers | point | to | p: | 1 |
| Constructor: | Tank   |          |       |    |    |   |
| Destructor:  | Tank   |          |       |    |    |   |
| Destructor:  | Gunner |          |       |    |    |   |
| Constructor: | No     | Name     |       |    |    |   |
| Constructor: | No     | Name     |       |    |    |   |
| Constructor: | No     | Name     |       |    |    |   |
| Destructor:  | No     | Name     |       |    |    |   |
| Destructor:  | No     | Name     |       |    |    |   |
| Destructor:  | No     | Name     |       |    |    |   |

** Weak Pointer
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream> <string> <memory>
class Dog {
  //std::shared_ptr<Dog> my_friend; // cyclic reference -> no destructor
  std::weak_ptr<Dog> my_friend;
  std::string name;
public:
  Dog(std::string name) {
    std::cout << "Constructor: " << name << std::endl;
    this->name = name;
  }
  ~Dog() { std::cout << "Destructor: " << name << std::endl; }
  void make_friend(std::shared_ptr<Dog> f) { my_friend = f; }
  void show_friend() {
    if (!my_friend.expired())
      std::cout << "My friend is: " << my_friend.lock()->name << std::endl;
  }
};

int main() {
  std::shared_ptr<Dog> p1(new Dog("Gunner"));
  std::shared_ptr<Dog> p2(new Dog("Tank"));
  p1->make_friend(p2);
  p2->make_friend(p1);
  p1->show_friend();
}
#+END_SRC

#+RESULTS:
| Constructor: | Gunner |     |      |
| Constructor: | Tank   |     |      |
| My           | friend | is: | Tank |
| Destructor:  | Tank   |     |      |
| Destructor:  | Gunner |     |      |

** Unique Pointer
#+BEGIN_SRC C++ :flags -std=c++11 :includes <iostream> <string> <memory>
class Dog {
  std::string name;
public:
  Dog(std::string name) {
    std::cout << "Constructor: " << name << std::endl;
    this->name = name;
  }
  ~Dog() { std::cout << "Destructor: " << name << std::endl; }
  void bark() { std::cout << name << " barks" << std::endl; }
};

void test_unique() {
  std::unique_ptr<Dog> p1(new Dog("Gunner"));
  //Dog* p2 = p1.release();
  //p1.reset(new Dog("Tank"));
  p1.reset(); // p1 = nullptr;
  if (!p1)
    std::cout << "p1 is empty.\n";
  else
    std::cout << "p1 is not empty.\n";
}

void move(std::unique_ptr<Dog> p) {
  p->bark();
}

int main() {
  test_unique();

  std::unique_ptr<Dog> p(new Dog("Smokey"));
  move(std::move(p));
}
#+END_SRC

#+RESULTS:
| Constructor: | Gunner |        |
| Destructor:  | Gunner |        |
| p1           | is     | empty. |
| Constructor: | Smokey |        |
| Smokey       | barks  |        |
| Destructor:  | Smokey |        |

